---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ReferenceIntersector
zh: 射线、射线相交
source: html/c4fb6c89-ca34-7c56-b730-98755d11fedf.htm
---
# ReferenceIntersector Members

**中文**: 射线、射线相交

Constructs a ReferenceIntersector which is set to return intersections from all elements and representing all reference target types.